#ifndef _DRIVER_CAN_PUBLIC_H_
#define _DRIVER_CAN_PUBLIC_H_

#include "can_cfg.h"

// /******************************************************************************
//  * 功能描述	: CAN消息结构体外部声明
//  * 创建人 		& 日期		 & 	版本日志 :
//  * 余业晨     & 2023-08-16 &  V001 初始版本
//  *****************************************************************************/
// extern flexcan_msgbuff_t recvCAN0Msg[5];
// extern flexcan_msgbuff_t recvCAN1Msg[5];

// /******************************************************************************
//  * 函数名		: DRIVER_CAN_Init
//  * 功能描述	: 初始化CAN模块
//  * 参数	: 无
//  * 返回值		: ret       : 函数执行状态
//  *****************************************************************************/
// extern status_t DRIVER_CAN_Init(void);

// /******************************************************************************
//  * 函数名		: DRIVER_CAN_ConfigRx
//  * 功能描述	: 配置指定CAN实例的接收消息箱
//  * 参数	: ********** 输入  **********
//  *                instance  : 待配置的CAN实例
//  *                msgID     : 指定的消息ID
//  *                msgBoxIdx : 消息箱索引
//  * 				  ********** 输出 **********
//  * 				  无
//  *****************************************************************************/
// extern status_t DRIVER_CAN_ConfigRx(uint8_t instance, uint32_t msgID, uint8_t msgBoxIdx);

// /******************************************************************************
//  * 函数名		: DRIVER_CAN_InstallRxCallback
//  * 功能描述	: 注册CAN接收事件回调函数
//  * 参数	: ********** 输入  **********
//  *                instance  : 待配置的CAN实例
//  *                callback  : 回调函数指针
//  * 				  ********** 输出 **********
//  * 				  无
//  *****************************************************************************/
// extern status_t DRIVER_CAN_InstallRxCallback(uint8_t instance,
// 											 flexcan_callback_t callback);

// /******************************************************************************
//  * 函数名		: DRIVER_CAN_RecvMsg
//  * 功能描述	: 启动CAN消息接收
//  * 参数	: ********** 输入  **********
//  *                instance  : 接收消息的CAN实例
//  *                msgBoxIdx : 消息箱索引
//  * 				  ********** 输出 **********
//  * 				  无
//  *****************************************************************************/
// extern status_t DRIVER_CAN_RecvMsg(uint8_t instance, uint8_t msgBoxIdx);

// /******************************************************************************
//  * 函数名		: DRIVER_CAN_SendMsg
//  * 功能描述	: 启动CAN消息发送
//  * 参数	: ********** 输入  **********
//  *                instance  : 发送消息的CAN实例
//  *                msgBoxIdx : 消息箱索引
//  *                msgID     : 消息ID
//  *                msgBytes  : 消息数据指针
//  * 				  ********** 输出 **********
//  * 				  无
//  *****************************************************************************/
// extern status_t DRIVER_CAN_SendMsg(uint8_t instance, uint8_t msgBoxIdx, uint32_t msgID,
// 								   uint8_t *msgBytes,uint8_t len ,uint8_t Is_CANFD);

// /******************************************************************************
//  * 函数名		: DRIVER_CAN_SleepConfig
//  * 功能描述	: CAN模块休眠配置，切换至低功耗模式
//  * 参数	: 无
//  * 返回值		: 无
//  *****************************************************************************/
// extern void DRIVER_CAN_SleepConfig(void);

// /******************************************************************************
//  * 函数名		: DRIVER_CAN_WakeupConfig
//  * 功能描述	: CAN模块唤醒配置，切换至正常工作模式
//  * 参数	: 无
//  * 返回值		: 无
//  *****************************************************************************/
// extern void DRIVER_CAN_WakeupConfig(void);


#endif
